const AbjadAbout = () => {
  return (
    <>
      <div className="flex justify-center mt-12 mx-6 mb-1.5">
        <div className="border border-gray-300 border-solid w-[80%] p-8 rounded">
          <h3>
            <span className="text-[rgb(255,0,0)]">حروف ابجد چیست؟</span>
          </h3>
          <p>
            حروف ابجد در واقع یک شیوه برای مخفی کردن عداد در حروف است. در این
            شیوه به هر کدام از حروف یک ارزش عددی داده می‌شود. و هم چنین شما با
            این کار می توانید عدد مرد نظر خود را به اسانی حفظ کنید.
            <br />
          </p>
          <p>
            <span className="text-[rgb(51,102,255)]">
              <strong>1. مثال:</strong>
            </span>{' '}
            غم عشق : ۱۵۱۰
          </p>
          <p>
            <span className="text-[rgb(51,102,255)]">
              <strong>2. مثال:</strong>
            </span>{' '}
            از بهشت جاویدان غافل مشو : ۲۲۴۷
          </p>

          <h3>
            <span className="text-[rgb(255,0,0)]">انواع کاربرد حروف ابجد؟</span>
          </h3>
          <p>
            <span className="text-[rgb(51,102,255)]">
              <strong>1. ترتیب بندی:</strong>
            </span>{' '}
            در متون بسیاری به جای شماره گذاری با اعداد، از حروف ابجد استفاده می
            شود. در برخی کتاب ها نیز صفحات مقدمه با حروف ابجد شماره گذاری می
            شود.
          </p>
          <p>
            <span className="text-[rgb(51,102,255)]">
              <strong>2. رمزگذاری:</strong>
            </span>{' '}
            از حروف ابجد برای نوشتن رمز نیز استفاده می شود. مثلا در متن یک نامه
            یا یک نوشته می توان به جای اشاره مستقیم به یک واژه یا جمله، معادل
            عددی ابجد آنها نوشته شود و یا بالعکس آن نیز امکان پذیر است.
          </p>
          <p>
            <span className="text-[rgb(51,102,255)]">
              <strong>3. تاریخ:</strong>
            </span>{' '}
            از حروف ابجد می توان برای به خاطر سپاری اعداد مهم یا تاریخ های مهم
            استفاده کرد. مثلا می توان اعداد و حروف معادل آنها را مانند یک واژه
            یا شعر به خاطر سپرد. مثلا کلمه{' '}
            <span className="font-bold">عدل مظفر</span> با حساب جمل، 1324 می
            شود. این عدد همان سالی است که مظفرالدین شاه، مشروطیت را امضاء نمود.
          </p>
        </div>
      </div>
    </>
  )
}

export default AbjadAbout
